Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: cannot convert %qE from type %qT to type %qT
en: 無法將 %qE 從類型 %qT 轉換到類型 %qT

source: cannot convert from base %qT to derived type %qT via virtual base %qT
en: 無法從基礎類別 %qT 轉換到衍生類別 %qT，透過虛基礎類別 %qT

source: cannot convert to a pointer type
en: 無法轉換為指標類型

source: cannot convert type %qT to type %qT
en: 不能將類型 %qT 轉換為類型 %qT

source: cannot create temporary file
en: 無法建立暫時檔案

source: cannot declare %<::main%> to be a template
en: 不能將 %<::main%> 宣告為一個範本

source: cannot declare %<::main%> to be inline
en: 不能將 %<::main%> 宣告為 inline

source: cannot declare %<::main%> to be static
en: 不能將 %<::main%> 宣告為 static

source: cannot declare %qD to be a bit-field type
en: 不能將 %qD 宣告為位元段類型

source: cannot declare bit-field %qD with function type
en: 不能將位元段 %qD 宣告為函式類型

source: cannot declare field %q+D to be of abstract type %qT
en: 不能將欄位 %q+D 宣告為具有抽象類型 %qT

source: cannot declare member function %<%T::%s%> within %<%T%>
en: 無法宣告成員函式 %<%T::%s%> 於 %<%T%> 之內

source: cannot declare member function %qD to have static linkage
en: 不能將成員函式 %qD 宣告為有靜態連結

source: cannot declare parameter %q+D to be of abstract type %qT
en: 不能將參數 %q+D 宣告為具有抽象類型 %qT

source: cannot declare pointer to %q#T
en: 無法宣告參照 %q#T 的指標

source: cannot declare reference to %q#T
en: 無法宣告對 %q#T 的參照

source: cannot declare static function inside another function
en: 不能在另一個函式中宣告一個靜態函式

source: cannot declare variable %q+D to be of abstract type %qT
en: 不能將變數 %q+D 宣告為具有抽象類型 %qT

source: cannot define member function %<%T::%s%> within %<%T%>
en: 無法定義成員函式 %<%T::%s%> 於 %<%T%> 之內

source: cannot delete a function. Only pointer-to-objects are valid arguments to %<delete%>
en: 不能 delete 一個函式。只有參照物件的指標才是 %<delete%> 的有效參數

source: cannot disable built-in function %qs
en: 無法停用內建函式 %qs

source: cannot dynamic_cast %qE (of type %q#T) to type %q#T (%s)
en: 無法將 %qE 從類型 %qT 動態_轉換到類型 %q#T (%s)

source: cannot find file for class %s
en: 無法為類別 %s 找到檔案

source: cannot handle inconsistent calls to %qs
en: 無法處理對 %qs 不一致的呼叫

source: cannot initialize aggregate of type %qT with a compound literal
en: 不可使用複合原文初始化類型為 %qT 的聚集

source: cannot initialize multi-dimensional array with initializer
en: 不能用初始值設定項來初始化多維陣列

source: cannot load VPN plugin "%s" due to missing "%s". Missing client plugin?
en: 無法加載VPN插件“%s" 因缺少“%s". 缺少客戶端插件？

source: cannot load VPN plugin in '%s': invalid service name
en: 無法加載VPN插件'%s': 服務名稱無效

source: cannot load VPN plugin in '%s': missing plugin name
en: 無法加載VPN插件'%s': 缺少插件名稱

source: cannot load legacy-only VPN plugin "%s" for "%s"
en: 無法加載僅限傳統的VPN插件“%s" 為“%s"

source: cannot load plugin "%s": %s
en: 無法加載插件“%s": %s

source: cannot optimize loop, the loop counter may overflow
en: 無法最佳化循環，循環變數可能溢出

source: cannot optimize possibly infinite loops
en: 無法最佳化可能無窮的循環

source: cannot pass argument in vector register because altivec instructions are disabled, use -maltivec to enable them
en: 不能在向量暫存器中傳遞參數，因為 altivec 指令集已被停用，使用 -maltivec 啟用

source: cannot read pac-script from file '%s'
en: 無法從文件中讀取pac腳本%s'

source: cannot read team config from file '%s'
en: 無法從文件中讀取團隊配置'%s'

source: cannot reload integer constant operand in %<asm%>
en: 不能在 %<asm%> 中重新載入整數常數運算元

source: cannot resolve overloaded function %qD based on conversion to type %qT
en: 無法解析多載函式 %qD，基於向類型 %qT 的轉換

source: cannot return from a handler of a function-try-block of a constructor
en: 不能從建構式的異常處理中回傳

source: cannot return value in vector register because altivec instructions are disabled, use -maltivec to enable them
en: 不能在向量暫存器中回傳值，因為 altivec 指令集已被停用，使用 -maltivec 啟用

source: cannot set connection.multi-connect for VPN setting
en: 無法為VPN設置設置connection.multi-connect

source: cannot set interrupt attribute: no current function
en: 無法設定插斷屬性：沒有目前函式

source: cannot set interrupt attribute: no such identifier
en: 無法設定插斷屬性：沒有這個識別碼

source: cannot specify both -C and -o
en: 不能同時指定 -C 和 -o

source: cannot specify both -msep-data and -mid-shared-library
en: 不能同時指定 -msep-data 和 -mid-shared-library

source: cannot take address of bit-field %qD
en: 無法取得位元段 %qD 的位址

source: cannot take the address of %<this%>, which is an rvalue expression
en: 無法取右值運算式 %<this%> 的位址

source: cannot use mode %qs for enumeral types
en: 無法為列舉類型使用模式 %qs

source: cannot use mshared and static together
en: 不能同時使用 mshared 和 static

source: cannot use mthreads and mlegacy-threads together
en: 不能同時使用 mthreads 和 mlegacy-threads

source: cannot use obsolete binding at %q+D because it has a destructor
en: 不能在 %q+D 使用過時的繫結，因為它有解構函式

source: cannot use typeid with -fno-rtti
en: 在指定 -fno-rtti 的情況下不能使用 typeid

source: cannot use va_start in interrupt function
en: 不能為插斷函式使用 va_start

source: can’t auto-merge directories
en: 無法自動合併資料夾

source: can’t auto-merge less than 3 files
en: 少於 3 個檔案無法自動合併

source: case label %qE not within a switch statement
en: case 標籤 %qE 未出現在 switch 敘述中

source: case label does not reduce to an integer constant
en: case 標籤不能還原為一個整常數

source: case label not within a switch statement
en: case 標籤出現在開關敘述外

source: case label value exceeds maximum value for type
en: case 標籤值比該類型的最大值還要大

source: case label value is less than minimum value for type
en: case 標籤值比該類型的最小值還要小

source: cast from %qT to %qT increases required alignment of target type
en: 從 %qT 到 %qT 的轉換增大了目的類型的對齊需求

source: cast from %qT to %qT loses precision
en: 從 %qT 到 %qT 的轉換損失精度

source: cast from function call of type %qT to non-matching type %qT
en: 從類型為 %qT 的函式呼叫轉換到不匹配的類型 %qT

source: cast from pointer to integer of different size
en: 當將一個指標轉換為大小不同的整數時給出警告

source: cast increases required alignment of target type
en: 類型轉換增大了目的類型的對齊需求

source: cast specifies array type
en: 類型轉換指定了陣列類型

source: cast specifies function type
en: 類型轉換指定了函式類型

source: cast to pointer from integer of different size
en: 當將一個指標轉換為大小不同的整數時給出警告

source: cast to union type from type not present in union
en: 類型轉換的來源類型未出現在聯合中

source: casting %qT to %qT does not dereference pointer
en: 從 %qT 轉換到 %qT 並未提領指標

source: certificate detected as invalid scheme
en: 证书无效

source: certificate or key file '%s' does not exist
en: 證書或密鑰文件'%s' 不存在

source: change :: change current value Displays current value and allows editing it.
en: change :: 更改目前的值 顯示目前的值，並允許對其進行編輯。

source: changes meaning of %qD from %q+#D
en: 變更了 %qD 的原意 %q+#D

source: choosing %qD over %qD
en: 選擇 %qD 而不是 %qD

source: circular pointer delegation detected
en: 偵測到循環指標代理

source: class %qT does not have any field named %qD
en: 類別 %qT 沒具名為 %qD 的欄位

source: class %qT is implicitly friends with itself
en: 類別 %qT 隱含地成為其自身的夥伴

source: class %qT will be considered nearly empty in a future version of GCC
en: 在 GCC 的未來版本中類別 %qT 將被看作幾乎為空

source: class '%s' has no method named '%s' matching signature '%s'
en: 類別「%s」沒具名為「%s」的方法能夠匹配簽字「%s」

source: class definition may not be declared a friend
en: 類別定義不能被宣告為夥伴

source: cleanup argument not a function
en: cleanup 引數不是一個函式

source: cleanup argument not an identifier
en: cleanup 引數不是一個識別碼

source: closing dependency file %s: %m
en: 關閉依賴檔案 %s：%m

source: collect: reading %s
en: collect：讀入 %s

source: collect: recompiling %s
en: collect：重新編譯 %s

source: collect: relinking
en: collect：重新連結

source: collect: tweaking %s in %s
en: collect：調整 %s，於 %s

source: comma at end of enumerator list
en: 列舉表以逗號結尾

source: comparing floating point with == or != is unsafe
en: 使用 == 或 != 比較浮點數是不安全的

source: comparison between pointer and integer
en: 比較指標和整數

source: comparison between signed and unsigned integer expressions
en: 在有號和無號整數運算式間比較

source: comparison is always %d
en: 比較結果始終為 %d

source: comparison is always %d due to width of bit-field
en: 由於位元段寬度所限，比較結果永遠為 %d

source: comparison is always false due to limited range of data type
en: 由於資料類型範圍限制，比較結果永遠為假

source: comparison is always true due to limited range of data type
en: 由於資料類型範圍限制，比較結果永遠為真

source: comparison of complete and incomplete pointers
en: 在完全和不完全指標間比較

source: comparison of distinct Objective-C types lacks a cast
en: 比較獨一無二的 Objective-C 類型時缺少轉換

source: comparison of distinct pointer types lacks a cast
en: 比較不相關的指標時缺少類型轉換

source: comparison of promoted ~unsigned with constant
en: 比較常數和取反後又經提升的無號數

source: comparison of unsigned expression < 0 is always false
en: 無號運算式永遠不小於 0

source: comparison of unsigned expression >= 0 is always true
en: 無號運算式永遠大於或等於 0

source: compilation terminated.
en: 編譯插斷。

source: complex invalid for %qs
en: 對 %qs 而言無效的複數

source: compound literal has variable size
en: 複合字面值有可變的大小

source: conflicting access specifications for field %qE, ignored
en: 欄位 %qE 的權限設定衝突，已忽略

source: conflicting access specifications for method %q+D, ignored
en: 方法 %q+D 的權限設定衝突，已忽略

source: conflicting code gen style switches are used
en: 衝突的程式碼產生選項

source: conflicting declaration %q#D
en: 相互衝突的宣告 %q#D

source: conflicting return type specified for %q+#D
en: 為 %q+#D 指定了衝突的回傳類型

source: conflicting types for %q+D
en: 與 %q+D 類型衝突

source: conflicting types for built-in function %q+D
en: 與內建函式 %q+D 類型衝突

source: conflicting value of mac-address-randomization and cloned-mac-address
en: mac-address-randomization和cloned-mac-address的衝突值

source: conflicts with built-in declaration %q#D
en: 與內建宣告 %q#D 衝突

source: conflicts with function declaration %q#D
en: 與函式宣告 %q#D 衝突

source: conflicts with new declaration with %qL linkage
en: 與帶有 %qL 連結的新宣告衝突

source: conflicts with previous declaration %q+#D
en: 與先前的宣告 %q+#D 衝突

source: connected
en: 已連線

source: connected (local only)
en: 已連上（只有本機）

source: connected (site only)
en: 已連上（只有網站）

source: connecting
en: 連線中

source: connecting (checking IP connectivity)
en: 正在連線（正在檢查 IP 連線）

source: connecting (configuring)
en: 連線中（配置中）

source: connecting (getting IP configuration)
en: 連線中（正在取得 IP 配置）

source: connecting (need authentication)
en: 連線中（需要身份認證）

source: connecting (prepare)
en: 連線中（準備）

source: connecting (starting secondary connections)
en: 正在連線（正在啟用次要連線）

source: connection
en: 連線

source: connection available
en: 連接可用

source: connection does not match access point
en: 連接與接入點不匹配

source: connection failed
en: 連線失敗

source: connections available
en: 連接可用

source: const_double_split got a bad insn:
en: const_double_split 得到一個錯誤的指令：

source: constant argument out of range for %qs
en: 常數引數超過 %qs 的範圍

source: construct property "%s" for object '%s' can't be set after construction
en: 建築物“%s" 對象'%s' 施工後無法設置

source: constructor cannot be static member function
en: 建構式不能是靜態成員函式

source: constructor syntax used, but no constructor declared for type %qT
en: 使用了建構式的語法，但沒有為類型 %qT 宣告建構式

source: constructors may not be cv-qualified
en: 建構式不能帶 cv 限定

source: control flow in the middle of basic block %d
en: 基本區塊 %d 中出現流程控制

source: conversion from %q#T to %q#T
en: 從 %q#T 到 %q#T 的轉換

source: conversion from %qT to %qT discards qualifiers
en: 從 %qT 到 %qT 的轉換丟失了限定資訊

source: conversion from %qT to non-scalar type %qT requested
en: 請求從 %qT 轉換到非標量類型 %qT

source: conversion lacks type at end of format
en: 格式字串末尾的轉換缺少類型

source: conversion to non-scalar type requested
en: 請求轉換到非標量類型

source: converting NULL to non-pointer type
en: 將 NULL 轉換為非指標類型

source: converting from %qT to %qT
en: 從 %qT 轉換到 %qT

source: converting overloaded function %qD to type %q#T is ambiguous
en: 將多載函式 %qD 轉換為類型 %q#T 有歧義

source: corrupted profile info: edge from %i to %i exceeds maximal count
en: 損壞的樣本資訊：從 %i 到 %i 的邊超過最大計數

source: corrupted profile info: number of executions for edge %d-%d thought to be %i
en: 損壞的樣本資訊：邊 %d-%d 的執行次數被認為是 %i

source: corrupted profile info: number of iterations for basic block %d thought to be %i
en: 損壞的樣本資訊：基本區塊 %d 的迭代次數被認為是 %i

source: corrupted profile info: run_max * runs < sum_max
en: 損壞的樣本資訊：run_max * runs < sum_max

source: corrupted profile info: sum_all is smaller than sum_max
en: 損壞的樣本資訊：sum_all 小於 sum_max

source: could not convert template argument %qE to %qT
en: 不能將範本參數從 %qE 轉換到 %qT

source: could not find a spill register
en: 找不到可捨出的暫存器

source: could not find class$ field in java interface type %qT
en: 在 java 介面類型 %qT 中找不到 class$ 欄位

source: could not find specs file %s
en: 找不到 specs 檔案 %s

source: could not split insn
en: 無法分離指令

source: created and used with different ABIs
en: 建立和使用時使用了不同的 ABI

source: created and used with different architectures / ABIs
en: 建立和使用時使用了不同的架構/ABI

source: created and used with different endianness
en: 建立和使用時使用了不同的高/低位位元組在前設定

source: created and used with different settings of -fpic
en: 建立和使用時使用了不同的 -fpic 設定

source: created and used with different settings of -fpie
en: 建立和使用時使用了不同的 -fpie 設定

source: created and used with differing settings of '%s'
en: 建立和使用時使用了不同的「%s」設定

source: creating array of %qT
en: 產生 %qT 的陣列

source: creating array of %qT, which is an abstract class type
en: 產生抽象類型 %qT 的陣列

source: creating pointer to member function of non-class type %qT
en: 產生非類別類型 %qT 的成員函式指標

source: creating pointer to member of non-class type %qT
en: 產生非類別類型 %qT 的成員指標

source: creating pointer to member of type void
en: 建立參照 void 類型的成員指標

source: creating pointer to member reference type %qT
en: 產生參照類型 %qT 的成員指標

source: ctrl
en: ktrl

source: data area of %q+D conflicts with previous declaration
en: %q+D 的資料區域與先前的宣告衝突

source: data declaration
en: 資料宣告

source: data definition has no type or storage class
en: 資料定義時沒有類型或存儲類別

source: data member %qD cannot be a member template
en: 資料成員 %qD 不能是成員範本

source: data member may not have variably modified type %qT
en: 資料成員不能具有可變類型 %qT

source: deactivated
en: 已停止

source: deactivating
en: 正在停用

source: debug format "%s" conflicts with prior selection
en: 除錯格式「%s」與先前的選擇衝突

source: debug output level %s is too high
en: 除錯輸出層級 %s 太高

source: declaration of %<~%T%> as member of %qT
en: %<~%T%> 宣告為 %qT 的一個成員

source: declaration of %q#D
en: %q#D 的宣告

source: declaration of %q#D outside of class is not definition
en: 出現在類別外的 %q#D 的宣告不是定義

source: declaration of %q+#D
en: %q+#D 的宣告

source: declaration of %q+D shadows a built-in function
en: %q+D 的宣告隱藏了一個內建函式

source: declaration of %q+D shadows a global declaration
en: %q+D 的宣告隱藏了一個全域宣告

source: declaration of %q+D shadows a parameter
en: %q+D 的宣告隱藏了一個參數

source: declaration of %q+D shadows previous non-variable
en: %q+D 的宣告隱藏了先前的一個非變數宣告

source: declaration of %q+D with attribute noinline follows inline declaration
en: %q+D 帶有 noinline 屬性的宣告出現在其內聯宣告之後

source: declaration of %q+D with no linkage follows extern declaration
en: %q+D 宣告為沒有外部連結的，之前卻有外部宣告

source: declaration of %qD as multidimensional array must have bounds for all dimensions except the first
en: 多維陣列 %qD 的宣告必須至少指定除第一維以外所有維的大小

source: declaration of %qD as non-function
en: %qD 沒有宣告為一個函式

source: declaration of %qD as non-member
en: %qD 未宣告為成員

source: declaration of %qD in %qD which does not enclose %qD
en: %qD 宣告出現在 %qD 中，而後者並不包含 %qD

source: declaration of %qD not in a namespace surrounding %qD
en: %qD 的宣告不在包含 %qD 的命名空間中

source: declaration of %qD shadows a global declaration
en: %qD 的宣告隱藏了一個全域宣告

source: declaration of %qD shadows a member of 'this'
en: %qD 的宣告隱藏了「this」的一個成員

source: declaration of %qD shadows a previous local
en: %qD 的宣告隱藏了先前的一個局部變數

source: declaration of C function %q#D conflicts with
en: C 函式 %q#D 的宣告

source: declaration of namespace %qD conflicts with
en: 命名空間 %qD 的宣告存在衝突，與

source: declaration of template %q#D
en: 範本宣告 %q#D

source: decrement of read-only member %qD
en: 令唯讀成員 %qD 自減

source: decrement of read-only variable %qD
en: 令唯讀成員 %qD 自增

source: default argument for %q#D has type %qT
en: %q#D 的預設引數類型為 %qT

source: default argument given for parameter %d of %q#D
en: 為參數 %d (屬於 %q#D)指定了預設引數

source: default argument missing for parameter %P of %q+#D
en: 參數 %P (屬於 %q+#D)缺少預設引數

source: default argument specified in explicit specialization
en: 明確特例化時指定了預設參數

source: default arguments are not allowed in declaration of friend template specialization %qD
en: 夥伴範本特例化 %qD 中不允許出現預設參數

source: defining explicit specialization %qD in friend declaration
en: 在夥伴宣告中定義明確特例化 %qD

source: definition of %q#T inside template parameter list
en: 在範本參數清單中定義了 %q#T

source: definition of %qD is not in namespace enclosing %qT
en: %qD 的定義不在包含 %qT 的命名空間中

source: definition provided for explicit instantiation
en: 為明確實體化提供的定義

source: deleting %qT is undefined
en: 刪除 %qT 未定義

source: deleting array %q#D
en: 刪除陣列 %q#D

source: dependent-name %qE is parsed as a non-type, but instantiation yields a type
en: 依賴名 %qE 被解析為非類型，但實體化卻產生了一個類型

source: deprecated covariant return type for %q+#D
en: %q+#D 的協變回傳類型已過時

source: deprecated semicolon at the end of value %s: '%s'
en: 在值的末尾棄用分號 %s: “%s'

source: deprecated use of default argument for parameter of non-function
en: 為非函式指定預設參數的用法已過時

source: dereferencing pointer to incomplete type
en: 提領參照不完全類型的指標

source: dereferencing type-punned pointer might break strict-aliasing rules
en: 提領類型雙關的指標可能破壞強重疊規則

source: dereferencing type-punned pointer will break strict-aliasing rules
en: 提領類型雙關的指標將破壞強重疊規則

source: derived type declaration
en: 衍生的類型宣告

source: derived union %qT invalid
en: 衍生聯合 %qT 無效

source: describe :: describe property Shows property description. You can consult nm-settings(5) manual page to see all NM settings and properties.
en: describe :: 描述內容 顯示內容的描述。您可查看 nm-settings(5) man page 以檢視所有的 NM 設定和內容。

source: describe [<setting>.<prop>] :: describe property Shows property description. You can consult nm-settings(5) manual page to see all NM settings and properties.
en: describe [<setting>.<prop>] :: 描述內容 顯示內容的描述。您可查看 nm-settings(5) man page，以檢視所有的 NM 設定和內容屬性。

source: destructor %qD declared as member template
en: 解構函式 %qD 被宣告為一個成員範本

source: destructor cannot be static member function
en: 解構函式不能是靜態成員函式

source: destructor for alien class %qT cannot be a member
en: 其它類別 %qT 的解構函式不能做為成員

source: destructors may not be cv-qualified
en: 解構函式不能被 cv 限定

source: destructors may not have parameters
en: 解構函式不能有參數

source: device '%s' not compatible with connection '%s'
en: 裝置「%s」和連線「%s」不相容

source: diff;merge;
en: 差異;合併;diff;merge;

source: direct base %qT inaccessible in %qT due to ambiguity
en: 由於存在歧義，直接基礎類別 %qT 在 %qT 中無法存取

source: disabled
en: 已停用

source: disconnected
en: 離線

source: disconnecting
en: 正在切斷連線

source: distinct Objective-C type in return
en: 回傳獨一無二的 Objective-C 類型

source: dominator of %d should be %d, not %d
en: %d 的主導者應該為 %d，而不是 %d

source: dominator of %d status unknown
en: %d 的主導者狀態不明

source: don't know how to get the property value
en: 不知如何取得內容值

source: don’t delete temporary files (for debugging)
en: not du dilit temporari fayls (für dibùgiŋ)

source: duplicate %<const%>
en: 重複的 %<const%>

source: duplicate %<restrict%>
en: 重複的 %<restrict%>

source: duplicate %qE
en: 重複的 %qE

source: duplicate %qs
en: 重複的 %qs

source: duplicate ConstantValue attribute for field '%s'
en: 為欄位「%s」重複指定了 ConstantValue 屬性

source: duplicate VF index %u
en: 重複的VF指數 %u

source: duplicate asm operand name %qs
en: 重複的組譯運算元名 %qs

source: duplicate base type %qT invalid
en: 重複的基礎類別型 %qT 無效

source: duplicate explicit instantiation of %q#T
en: 對 %q#T 重複的明確實體化

source: duplicate initialization of %qD
en: ISO C++ 不允許成員 %qD 的初始化

source: duplicate label declaration %qE
en: 重複的標籤定義 %qE

source: duplicate member %q+D
en: 重複的成員 %q+D

source: duplicate property
en: 重複財產

source: dynamic dependency %s not found
en: 找不到動態依賴項 %s

source: edge points to wrong declaration:
en: 邊緣指到不對的宣告：

source: element invalid
en: 元素不合規定

source: embedded %<\0%> in format
en: 格式字串嵌有 %<\0%>

source: empty declaration
en: 空宣告

source: empty declaration with storage class specifier does not redeclare tag
en: 帶有存儲類別的空宣告沒有重宣告標記

source: empty index range in initializer
en: 初始值設定項中索引範圍為空

source: empty left precision in %s format
en: %s 格式字串中左精度為空

source: empty precision in %s format
en: %s 格式字串中精度為空

source: empty range specified
en: 指定範圍為空

source: empty scalar initializer
en: 空的標量初始值設定項

source: enabled
en: 已啟用

source: enters try block
en: 進入 try 區塊

source: enumeral and non-enumeral type in conditional expression
en: 列舉和非列舉類型一起出現在條件運算式中

source: enumeral mismatch in conditional expression: %qT vs %qT
en: 條件運算式中列舉不匹配：%qT 對 %qT

source: enumeration values exceed range of largest integer
en: 列舉值超過了最大整數類型可表示的範圍

source: environment variable DJGPP not defined
en: 沒有定義 DJGPP 環境變數

source: environment variable DJGPP points to missing file '%s'
en: 環境變數 DJGPP 參照的檔案「%s」不存在

source: error in constant pool entry #%d
en: 常數池條目 #%d 發生錯誤

source: error while parsing constant pool
en: 解析常數池時發生錯誤

source: error while parsing fields
en: 解析欄位時發生錯誤

source: error while parsing final attributes
en: 解析 final 屬性時發生錯誤

source: error while parsing methods
en: 解析方法時發生錯誤

source: error writing %qs
en: 寫入 %qs 時錯誤

source: error writing to %s: %m
en: 寫入 %s 時發生錯誤：%m

source: error:
en: 錯誤：

source: excess elements in array initializer
en: 陣列初始值設定項中有多餘的元素

source: excess elements in char array initializer
en: 字元陣列初始值設定項中有多餘元素

source: excess elements in scalar initializer
en: 標量初始值設定項中有多餘元素

source: excess elements in struct initializer
en: 結構初始值設定項中有多餘元素

source: excess elements in union initializer
en: 聯合初始值設定項中有多餘元素

source: excess elements in vector initializer
en: 向量初始值設定項中有多餘元素

source: expected %<,%> or %<;%>
en: 需要 %<,%> 或 %<;%>

source: expected %<,%> or %<}%>
en: 需要 %<,%> 或 %<}%>

source: expected %<,%>, %<;%> or %<}%>
en: 需要 %<,%>、%<;%> 或 %<}%>

source: expected %<:%> or %<...%>
en: 需要 %<:%> 或 %<...%>

source: expected %<:%>, %<,%>, %<;%>, %<}%> or %<__attribute__%>
en: 需要 %<:%>，%<,%>，%<;%>，%<}%> 或 %<__attribute__%>

source: expected %<=%>, %<,%>, %<;%>, %<asm%> or %<__attribute__%>
en: 需要 %<=%>，%<,%>，%<;%>，%<asm%> 或 %<__attribute__%>

source: expected %d levels of template parms for %q#D, got %d
en: 需要 %d 級的 %q#D 範本參數，卻給出了 %d 級

source: expected a class template, got %qE
en: 需要一個類別範本，卻給出了 %qE

source: expected a constant of type %qT, got %qT
en: 需要一個 %qT 類型的常數，卻給出了 %qT

source: expected a type, got %qE
en: 需要一個類型，卻給出了 %qE

source: expected a type, got %qT
en: 需要一個類型，卻給出了 %qT

source: expected an SSA_NAME object
en: 需要一個 SSA_NAME 物件

source: expected class name
en: 需要類別名

source: expected declaration specifiers or %<...%>
en: 需要指定宣告或 %<...%>

source: expected expression
en: 需要運算式

source: expected identifier
en: 需要識別碼

source: expected identifier or %<(%>
en: 需要識別碼或 %<(%>

source: expected identifier or %<*%>
en: 需要識別碼或 %<*%>

source: expected qualified name in friend declaration for destructor %qD
en: 在解構函式 %qD 中的夥伴宣告需要限定名

source: expected specifier-qualifier-list
en: 需要指定符-限制符清單

source: explicit goto at end of bb %d
en: 基本區塊 %d 末尾明確的 goto

source: explicit instantiation of %q#D
en: 對 %q#D 的明確實體化

source: explicit instantiation of %q#T before definition of template
en: %q#T 的明確實體化出現在範本定義之前

source: explicit instantiation of non-template type %qT
en: 明確實體化非範本類型 %qT

source: explicit qualification in declaration of %qD
en: %qD 的宣告中有明確的限定

source: explicit specialization in non-namespace scope %qD
en: 明確特例化出現在非命名空間作用欄位 %qD 中

source: explicit specialization of %qD after first use
en: 在初次使用後明確特例化 %qD

source: explicit specialization of %qD must be introduced by %<template <>%>
en: %qD 的明確特例化必須由 %<template <>%> 引入

source: explicit specialization of non-template %qT
en: 明確特例化非範本 %qT

source: expression in new-declarator must have integral or enumeration type
en: new 宣告中的運算式必須具有整數或列舉類型

source: expression statement has incomplete type
en: 運算式敘述類型不完全

source: extended registers have no high halves
en: 擴充的暫存器沒有高半部分

source: extern declaration of %q+D follows declaration with no linkage
en: %q+D 宣告為沒有外部連結的，之前卻有外部宣告

source: extra %<;%>
en: 多餘的 %<;%>

source: extra brace group at end of initializer
en: 初始值設定項末尾有多餘的大括號組

source: extra elements in scalar initializer
en: 標量初始化設定中有多餘元素

source: extra outgoing edge %d->%d
en: 多餘的出邊 %d->%d

source: extra qualification %<%T::%> on member %qs
en: 有多餘的限定 %<%T::%> 於成員 %qs 上

source: extra semicolon in method definition specified
en: 為方法定義指定了多餘的分號
